import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { CardTariffsComponent } from './card-tariffs/card-tariffs.component';
import { item } from './card-tariffs/card-tariffs.interface';
import { DomSanitizer } from '@angular/platform-browser';
import { CardDefaultTariffsComponent } from './card-default-tariffs/card-default-tariffs.component';

@Component({
  selector: 'app-page-tariffs',
  standalone: true,
  imports: [CommonModule, CardTariffsComponent, CardDefaultTariffsComponent],
  templateUrl: './page-tariffs.component.html',
  styleUrl: './page-tariffs.component.css'
})
export class PageTariffsComponent {

  cardsTariffs: item[] = [];

  constructor(private sanitizer: DomSanitizer) {
    this.cardsTariffs = [
      {
        icon: this.sanitizer.bypassSecurityTrustHtml(`
          <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M4.59961 9.92304C9.67261 0.469042 15.9896 0.360042 18.5126 1.48704C19.6396 4.01104 19.5306 10.327 10.0766 15.4C9.97861 14.836 9.43361 13.36 8.03661 11.963C6.63961 10.566 5.16361 10.021 4.59961 9.92304Z" stroke="#F8F8F8" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
            <path d="M11.35 14.9501C13.189 15.8501 13.385 17.4641 13.64 19.0001C13.64 19.0001 17.49 16.1541 15.027 12.2501M5.05 8.72708C4.15 6.88808 2.536 6.69208 1 6.43708C1 6.43708 3.847 2.58708 7.75 5.05008M4.018 12.9121C3.506 13.4231 2.636 14.9081 3.25 16.7501C5.093 17.3641 6.577 16.4941 7.09 15.9831M15.3 6.45008C15.3 5.98595 15.1156 5.54083 14.7874 5.21264C14.4592 4.88446 14.0141 4.70008 13.55 4.70008C13.0859 4.70008 12.6408 4.88446 12.3126 5.21264C11.9844 5.54083 11.8 5.98595 11.8 6.45008C11.8 6.91421 11.9844 7.35933 12.3126 7.68752C12.6408 8.01571 13.0859 8.20008 13.55 8.20008C14.0141 8.20008 14.4592 8.01571 14.7874 7.68752C15.1156 7.35933 15.3 6.91421 15.3 6.45008Z" stroke="#F8F8F8" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
          </svg>
        `),
        price: 500,
        title: 'Старт',
        conditions: [
          {
            title: 'Срок действия',
            value: '1',
            textItem: 'месяц'
          },
          {
            title: 'Количество публикаций',
            value: '+ 2',
            textItem: 'вакансии'
          },
          {
            title: 'Количество публикаций',
            value: '+ 2',
            textItem: 'резюме'
          }
        ],
        descriptions: ['Тариф предоставляет доступ к публикации еще 2 резюме и 2 вакансий к Бесплатному тарифу ',
          'Считаются только активные вакансии и резюме',
          'Вакансии могут быть опубликованы как от лица пользователя так и от лица Команды в которой пользователь является администратором '
        ]
      },
      {
        icon:
          this.sanitizer.bypassSecurityTrustHtml(`
        <svg width="25" height="24" viewBox="0 0 25 24" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path fill-rule="evenodd" clip-rule="evenodd" d="M7.55559 3C7.28618 3.00009 7.02095 3.0676 6.78347 3.19654C6.54598 3.32548 6.34359 3.51186 6.19426 3.73913L2.8386 8.83911C2.63384 9.15182 2.60953 9.5517 2.77503 9.88715C4.61244 13.6087 7.1643 16.9212 10.2811 19.6304L11.9173 21.0527C12.1257 21.2338 12.3912 21.3333 12.6657 21.3333C12.9403 21.3333 13.2058 21.2338 13.4142 21.0527L15.0504 19.6313C18.1676 16.9219 20.7198 13.6091 22.5574 9.88715C22.7229 9.5517 22.6976 9.15182 22.4929 8.83911L19.1354 3.73913C18.986 3.51217 18.7837 3.32606 18.5464 3.19729C18.3091 3.06853 18.0441 3.00109 17.775 3.00095L7.55559 3ZM7.36112 4.52658C7.38249 4.49419 7.41143 4.46764 7.44535 4.4493C7.47927 4.43095 7.51714 4.42137 7.55559 4.4214H9.74345L7.95296 8.77657C7.91317 8.87665 7.88189 8.98 7.85946 9.08548C7.20099 9.0357 6.5433 8.97568 5.88665 8.90544L4.573 8.76614L7.36112 4.52658ZM4.51222 10.1885C6.1908 13.3075 8.40529 16.0977 11.0515 18.4279L8.12967 10.5306C7.33251 10.475 6.53639 10.4049 5.74173 10.3202L4.51222 10.1885ZM9.66024 10.6187L12.6653 18.7434L15.6712 10.6187C13.6683 10.7107 11.6623 10.7107 9.6593 10.6187M17.2018 10.5306L14.28 18.4279C16.9262 16.0977 19.1407 13.3075 20.8193 10.1885L19.5898 10.3202C18.795 10.4042 17.999 10.4743 17.2018 10.5306ZM20.7575 8.76614L19.443 8.90639C18.7863 8.97663 18.1286 9.03665 17.4701 9.08643C17.4481 8.98066 17.4171 8.87699 17.3776 8.77657L15.5871 4.4214H17.775C17.8134 4.42137 17.8513 4.43095 17.8852 4.4493C17.9191 4.46764 17.9481 4.49419 17.9694 4.52658L20.7575 8.76614ZM16.0237 9.17835C13.7854 9.29585 11.5464 9.29585 9.30681 9.17835L11.2628 4.4214H14.0677L16.0237 9.17835Z" fill="#F8F8F8" />
  </svg>
        `),
        price: 1000,
        title: 'Про +',
        conditions: [
          {
            title: 'Срок действия',
            value: '1',
            textItem: 'месяц'
          },
          {
            title: 'Количество публикаций',
            value: '+ 7',
            textItem: 'вакансии'
          },
          {
            title: 'Количество публикаций',
            value: '+ 7',
            textItem: 'резюме'
          }
        ],
        descriptions: [
          'Тариф предоставляет доступ к публикации еще 2 резюме и 2 вакансий к Бесплатному тарифу ',
          'Считаются только активные вакансии и резюме',
          'Вакансии могут быть опубликованы как от лица пользователя так и от лица Команды в которой пользователь является администратором '
        ]
      },
      {
        icon:
      this.sanitizer.bypassSecurityTrustHtml(`
       <svg width="18" height="24" viewBox="0 0 18 24" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M11.521 6.82109C11.4029 6.4867 11.184 6.19717 10.8945 5.99238C10.605 5.78759 10.2591 5.67764 9.90444 5.67766H8.5793C8.2024 5.67872 7.83914 5.81878 7.55909 6.07102C7.27903 6.32325 7.10187 6.66993 7.06153 7.04467C7.02119 7.4194 7.12051 7.79585 7.34046 8.10191C7.56042 8.40797 7.88555 8.62213 8.25358 8.70338L10.273 9.14395C10.688 9.23244 11.0555 9.47171 11.3043 9.81548C11.5531 10.1592 11.6655 10.5831 11.6199 11.0049C11.5742 11.4268 11.3737 11.8168 11.0572 12.0994C10.7406 12.382 10.3305 12.5371 9.90616 12.5348H8.76444C8.40981 12.5348 8.0639 12.4249 7.77438 12.2201C7.48485 12.0153 7.26596 11.7258 7.14787 11.3914M9.33358 5.67766V3.96338M9.33358 14.2491V12.5348" stroke="#F8F8F8" stroke-linecap="round" stroke-linejoin="round" />
  <path d="M5.90467 23.1428H12.7618M17.0475 8.62449C17.057 7.24751 16.6978 5.89309 16.0071 4.70183C15.3164 3.51056 14.3194 2.52589 13.1197 1.85004C11.92 1.17418 10.5612 0.831777 9.18443 0.858373C7.80767 0.884969 6.46313 1.2796 5.29039 2.00128C4.11765 2.72297 3.15945 3.74541 2.51528 4.96246C1.87112 6.17951 1.56446 7.5468 1.62714 8.92239C1.68982 10.298 2.11957 11.6317 2.87175 12.7851C3.62394 13.9385 4.67115 14.8696 5.90467 15.4816V18.0531C5.90467 18.2804 5.99498 18.4984 6.15572 18.6592C6.31647 18.8199 6.53449 18.9102 6.76181 18.9102H11.9047C12.132 18.9102 12.35 18.8199 12.5108 18.6592C12.6715 18.4984 12.7618 18.2804 12.7618 18.0531V15.4816C14.0432 14.8503 15.1231 13.8741 15.8802 12.6628C16.6373 11.4514 17.0416 10.053 17.0475 8.62449Z" stroke="#F8F8F8" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
</svg>
        `),
        price: 1500,
      title: 'Бизнес',
      conditions: [
        {
          title: 'Срок действия',
          value: '1',
          textItem: 'месяц'
        },
        {
          title: 'Количество публикаций',
          value: '',
          textItem: 'без ограничений'
        },
        {
          title: 'Количество публикаций',
          value: '',
          textItem: 'без ограничений'
        }
      ],
      descriptions: [
        'Тариф предоставляет доступ к публикации еще 2 резюме и 2 вакансий к Бесплатному тарифу ',
        'Считаются только активные вакансии и резюме',
        'Вакансии могут быть опубликованы как от лица пользователя так и от лица Команды в которой пользователь является администратором '
      ]
      }
    ]
}
  
  
}